<?php
/*
+ ----------------------------------------------------------------------------------------------+
|     e107 website system  : http://e107.org.ru
|     Released under the terms and conditions of the GNU General Public License (http://gnu.org).
|
|     Plugin "my_gallery"
|     Author: Alex ANP alex-anp@ya.ru
+-----------------------------------------------------------------------------------------------+
*/

define("PAGE_NAME", "Галерея");
define("MYGAL_L001", "My_Gallery");
define("MYGAL_L0011", "Плагин My_Gallery создает фотогалерею, основан на технологии Highslide JS");
define("MYGAL_L002", "Случайная картинка");
define("MYGAL_L003", "Галерея");
define("MYGAL_L004", "Настройки сохранены");
define("MYGAL_L005", "Настройки галереи");
define("MYGAL_L006", "Путь к фотогалереи (URL):");
define("MYGAL_L007", "Количество иконок на странице (колонок * рядов):");
define("MYGAL_L008", "Максимальная высота иконки (в точках):");
define("MYGAL_L009", "Максимальная ширина иконки (в точках):");
define("MYGAL_L010", "Максимальная высота просмотра фотографии (в точках):");
define("MYGAL_L011", "Максимальная ширина просмотра фотографии (в точках):");
define("MYGAL_L012", "Путь к титульной картинке (URL):");
define("MYGAL_L013", "Название фотогалереи:");
define("MYGAL_L014", "Настройка меню галереи");
define("MYGAL_L015", "Заголовок меню галереи:");
define("MYGAL_L016", "Путь к каталогу для случайной выборки картинок (URL):");
define("MYGAL_L017", "Максимальный размер картинки в меню (в точках):");
define("MYGAL_L018", "Сохранить настройки");
define("MYGAL_L019", "Администрирование фотогалереи");
define("MYGAL_L020", "Необходимо выбрать галерею");
define("MYGAL_L021", "Навигация по галерее");
define("MYGAL_L022", "Скачать");
define("MYGAL_L023", "Положение панели навигации:");
define("MYGAL_L024", "Сверху страницы");
define("MYGAL_L025", "Внизу страницы");
define("MYGAL_L026", "Размер:");
define("MYGAL_L027", "Файл:");
define("MYGAL_L028", "Метод отображения иконок:");
define("MYGAL_L029", "Показывать иконки в виде слайдов (images/tn_blank.jpg)");
define("MYGAL_L030", "Показывать описание к галерее:");
define("MYGAL_L031", "Не активно");
define("MYGAL_L032", "Над галереей");
define("MYGAL_L033", "Под галереей");
define("MYGAL_L034", "Изменение описания для галереи:");
define("MYGAL_L035", "Сохранить");
define("MYGAL_L036", "Название");
define("MYGAL_L037", "Описание");
define("MYGAL_L038", "[Изменить]");
define("MYGAL_L039", "На главной странице показывать:");
define("MYGAL_L040", "Титульный файл");
define("MYGAL_L041", "Случайные файлы");
define("MYGAL_L042", "Количество случайных картинок:");
define("MYGAL_L043", "Меню Галереи");
define("MYGAL_L044", "Разрешить комментировать фотографии:");
define("MYGAL_L045", "Комментарии:");
define("MYGAL_L046", "Каталог/Раздел:");
define("MYGAL_L047", "Разрешить оценивать фотографии:");
define("MYGAL_L048", "Стиль отображения Highslide:");
define("MYGAL_L049", "Файлы иконок и просмотра:");
define("MYGAL_L050", "Файлы иконок");
define("MYGAL_L051", "Файлы просмотра");
define("MYGAL_L052", "Обновить существующие");
define("MYGAL_L053", "Создать/обновить");
define("MYGAL_L054", "Качество (%)");
define("MYGAL_L055", "Метод сортировки изображений:");
define("MYGAL_L056", "Переместить");
define("MYGAL_L057", "Закрыть");
define("MYGAL_L058", "Добавить изображение");
define("MYGAL_L059", "Спасибо. Ваша загрузка на сервер будет проверена администратором и добавлена, если будет одобрена.");
define("MYGAL_L060", "У вас нет необходимых разрешений на загрузку файлов на этот сервер.");
define("MYGAL_L061", "Ошибка!");
define("MYGAL_L062", "Имя");
define("MYGAL_L063", "e-mail");
define("MYGAL_L064", "Файл превышает указанный максимальный размер - удален.");
define("MYGAL_L065", "Удалить");
define("MYGAL_L066", "Опубликовать");
define("MYGAL_L067", "Прислал");
define("MYGAL_L068", "Последние добавления");
define("MYGAL_L069", "Последние комментарии");
define("MYGAL_L070", "Гость");
define("MYGAL_L071", "Оригинал");
define("MYGAL_L072", "Переместить");
define("MYGAL_L073", "Управление");
define("MYGAL_L074", "Новые поступления");


?>