<?php
//============================= Notice-Board v4.0 ===============================
//	author: ComPolyS team, http://e107.compolys.ru, sunout@compolys.ru		
//	coders: Sunout, Geo						
//	language officer Georgy Pyankov
//	license GNU GPL									
//================================== Deсember 2011 =============================
/*---------------info plugin--------------------*/
define('NB_INFO',"Доска объявлений");
define('NB_EDIT',"Настройки доски объявлений");
define('NB_AUTHOR_NAME',"ComPolyS Team");
define('NB_AUTHOR_SITE',"http://e107.compolys.ru");
define('NB_AUTHOR_MAIL',"sunout@compolys.ru");
define('NB_ABOUT',"Notice-Board. Плагин доски объявлений.");
define('NB_INSTALL',"Notice-Board успешно установлена!");
define('NB_UNINSTALL',"Notice-Board удалена...");
define('NB_CODERS',"программирование");
define('NB_CODERS_NAME',"Sunout (Казанцев Сергей), Geo (Георгий Матвеев)");
define('NB_TRANSLATOR',"Перевод с русского языка");
define('NB_TRANSLATOR_NAME',"Георгий Пьяноков");
/*---------------menu---------------------------*/
define('NB_ADMIN_MENU',"Меню администратора");
/*--------------config--------------------------*/
define('NB_CON_MENU',"Конфигурации");
define('NB_CONF_00',"Настройки доски объявлений");
define('NB_CONF_01',"E-mail Доски объявлений");
define('NB_CONF_02',"Обявление действительно (дней)");
define('NB_CONF_03',"Формат представления даты");
define('NB_CONF_04',"Уменьшить загружаемое изображение до");
define('NB_CONF_05',"Уменьшить иконку загружаемого изображения до");
define('NB_CONF_06',"Во сколько столбцов выводить категори?");
define('NB_CONF_07',"Cколько строк объявлений выводить на первой странице?");
define('NB_CONF_08',"Контрольный вопрос, защита от спама");
define('NB_CONF_09',"Ответ на контрольный вопрос");
define('NB_CONF_10',"На сколько дней разрешить продление?");
define('NB_CONF_11',"Разрешить комментарии на доске объявлений?");
/*---------------category-----------------------*/
define('NB_CAT_MENU',"Категории");
define('NB_CAT_00',"Управление категориями доски объявлений");
define('NB_CAT_01',"Категории");
define('NB_CAT_02',"Категория");
define('NB_CAT_03',"Имя категории");
define('NB_CAT_04',"Описание категории");
define('NB_CAT_05',"Выберите категорию");
define('NB_SCAT_MENU',"Под-категории");
define('NB_SCAT_00',"Управление под-категориями доски объявлений");
define('NB_SCAT_01',"Под-категории");
define('NB_SCAT_02',"Под-категория");
define('NB_SCAT_03',"Имя под-категории");
define('NB_SCAT_04',"Под-категории объявлений");
define('NB_SCAT_05',"Выберите подкатегорию");
define('NB_SCAT_06',"Переместить категорию в :");
define('NB_SCAT_07',"Выберите родительскую категорию");
/*--------------notice--------------------------*/
define('NB_NOT_MENU',"Объявления");
define('NB_NOT_00',"Управление объявлениями");
define('NB_NOT_01',"Объявления");
define('NB_NOT_02',"Выберите объявление");
define('NB_NOT_03',"Заголовок объявления");
define('NB_NOT_04',"Категория объявления");
define('NB_NOT_05',"Под-категория объявления");
define('NB_NOT_06',"Полный текст объявления");
define('NB_NOT_07',"Цена");
define('NB_NOT_08',"Имя");
define('NB_NOT_09',"Город");
define('NB_NOT_10',"Номер телефона");
define('NB_NOT_11',"E-mail для связи");
define('NB_NOT_12',"Продлить объявление на");
define('NB_NOT_13',"Дней");
define('NB_NOT_15',"Дата публикации");
define('NB_NOT_16',"Дата окончания публикации");
/*--------------banner--------------------------*/
define('NB_BAN_MENU',"Баннеры");
define('NB_BAN_00',"Управление баннерами доски объявлений");
define('NB_BAN_01',"Категория");
define('NB_BAN_02',"Выберите категорию");
define('NB_BAN_03',"Организация");
define('NB_BAN_04',"Ссылка на сайт");
define('NB_BAN_05',"Дата включения / выключения баннера");
define('NB_BAN_06',"Баннер");
define('NB_BAN_07',"Выбрать баннер");
define('NB_BAN_08',"Показать баннеры");
define('NB_BAN_09',"Управление");
define('NB_BAN_10',"Главная страница");
define('NB_BAN_11',"На всех страницах");
/*--------------about---------------------------*/
define('NB_ABO_MENU',"О плагине");
define('NB_ABO_CAP',"Информация о плагине");
define('NB_ABO_NOW',"<b>Возможности этой версии плагина Notice-Board:</b>
<br>1) Комментарии к объявлениям,
<br>2) Счетчик, который следит за количеством просмотров объявлений,
<br>3) Собственная система управления баннерами,
<br>4) Заголовок доски объявлений оснащен системой ссылок для удобного перехода,
<br>5) Плагин имеет русскую, английскую и немецкую версию языковых пакетов,
<br>6) Система защиты от спама,
<br>7) Возможность выбора формата даты для вывода,
<br>8) Если вы используете плагин 'Новое на сайте', то вы можете включить в него Notice-Board. Выводятся объявления имеющие картинки,
<br>9) Оформление плагина соответсвует общему оформлению сайта.");
define('NB_ABO_INFO',"
Как и прежде, вы можете оставить ваши пожелания и предложения по работе плагина на <a href='http://e107.compolys.ru'>сайте разработки и технической поддержки плагинов для любимой системы Е107</a>. <br><br>Так же Вы можете присоедениться к команде разработчиков. Мы всегда открыты для сотрудничества в области дизайна и программирования. Философия нашей команды - GNU GPL. Свободный софт - для свободных людей! 
<br><br>Если Вы используете наш плагин и хотели бы его почаще обновлять - Вы можете помочь проекту любым способом:<br>1) Разместите на своем ресурсе эту кнопку <img src='".e_PLUGIN."nboard/theme/e107_compolys.png' alt='".NB_INFO."'> с ссылкой на наш сайт<br>
Вот код: <font color=red>&#60a href='http://e107.compolys.ru'&#62&#60img src='&#34.e_PLUGIN.&#34nboard/theme/e107_compolys.png' alt='&#34.NB_INFO.&#34'&#62&#60/a&#62</font><br>
2) Разместить баннер на доске объявлений с сылкой на наш сайт(баннер можно включить из админской части)<br>
3) Или сделайте пожертвования любым из перечиселнных способов на нашем сайте, все полученные средсва помогают развивать проект быстрее.<br>
<br><b>Яндекс деньги, рублевый счет: 41001945332279</b>");
define('NB_ABO_FUTURE',"<b>Планы на разработку Notice-Board:</b>
<br>1) Возможность незарегестрированным пользователям управлять подаными объявлениями,
<br>2) Разделение объявлений на частные и объявления коммерческого храктера,
<br>3) Улучшить работу с изображениями объявлений при редактировании,
<br>4) Добавить возможность загрузки нескольких изображений к одному объявлению,
<br>5) Доработать редактирование объявлений в админской части,
<br>6) Доработка админской части по объявлениям, пока можно только просматривать и удалять объявления,
<br>7) Добавить рассылку по окончанию срока объявлений,
<br>8) Создание механизма отслеживания новой версии и механизм автоматического обновления,
<br>9) Перевод всех диалогов и сообщений на js или ajax.");
/*--------------add-----------------------------*/
define('NB_ADD_CAP',"Управление объявлениями");
define('NB_ADD_01',"Заголовок объявления");
define('NB_ADD_02',"Категория");
define('NB_ADD_03',"Пожалуйста, выберите категорию");
define('NB_ADD_04',"Под-категория");
define('NB_ADD_05',"Пожалуйста, выберите под-категорию");
define('NB_ADD_06',"Загрузить картинку");
define('NB_ADD_07',"Полный текст объявления");
define('NB_ADD_08',"Цена");
define('NB_ADD_09',"Ваше имя (ник)");
define('NB_ADD_10',"Населенный пункт");
define('NB_ADD_11',"Номер телефона");
define('NB_ADD_12',"E-mail для связи");
define('NB_ADD_13',"Решите пример");
define('NB_ADD_14',"Объявления");
define('NB_ADD_15',"Дата");
define('NB_ADD_16',"Цена");
define('NB_ADD_17',"Ваши предыдущие объявления");
/*--------------nboard---------------------------*/
define('NB_NAME_01',"Дата");
define('NB_NAME_02',"Объявление");
define('NB_NAME_03',"Цена,руб");
define('NB_NAME_04',"Населенный пункт");
define('NB_NAME_05',"");
/*--------------viewads---------------------------*/
define('NB_VIEW_CAP',"Объявление");
define('NB_VIEW_01',"Заголовок");
define('NB_VIEW_02',"Полный текст объявления");
define('NB_VIEW_03',"Цена");
define('NB_VIEW_04',"Изображение");
define('NB_VIEW_05',"Отсутствует");
define('NB_VIEW_06',"Предыдущий");
define('NB_VIEW_07',"Следующий");
define('NB_VIEW_08',"Автор");
define('NB_VIEW_09',"Город (населенный пункт)");
define('NB_VIEW_10',"Номер телефона");
define('NB_VIEW_11',"E-mail для связи");
define('NB_VIEW_12',"Написать автору");
define('NB_VIEW_13',"Дата публикации / окончания");
define('NB_VIEW_14',"Количество просмотров");
define('NB_AUTH_1',"Автор");
/*--------------serch----------------------------*/
define('NB_SARCH_CAP',"Поиск объявлений");
define('NB_SARCH_01',"Введите текст для поиска");
define('NB_SARCH_02',"по заголовку объявления");
define('NB_SARCH_03',"по тексту объявления");
define('NB_SARCH_04',"объявления");
define('NB_SARCH_05',"текст объявления");
define('NB_SARCH_06',"К сожалению, по вашему запросу ничего не найдено. Попробуйте изменить критерий поиска.");
/*--------------navigation------------------------*/
define('NB_NAVI_01',"Панель навигации");
define('NB_NAVI_02',"Найти объявления");
define('NB_NAVI_03',"Добавить/Править");
define('NB_NAVI_04',"На главную");
define('NB_NAVI_05',"Предыдущее");
define('NB_NAVI_06',"Следущее");
/*--------------images----------------------------*/
define('NB_IMG_00',"Изображение");
define('NB_IMG_01',"Загрузить картинку");
define('NB_IMG_02',"Выбрать иконку");
define('NB_IMG_03',"Показать иконки");
define('NB_IMG_04',"Поменять картинку");
/*--------------action---------------------------*/
define('NB_COL_00', "Выбирите количество деней публикации объявления");
define('NB_COL_01', "7 Дней");
define('NB_COL_02', "15 Дней");
define('NB_COL_03', "30 Дней");
/*--------------date formate---------------------*/
define('NB_RDATE_01', "00.00.0000");
define('NB_FDATE_01', "%d.%m.%Y");
define('NB_RDATE_02', "00-00-0000");
define('NB_FDATE_02', "%d-%m-%Y");
/*--------------button----------------------------*/
define('NB_BUT_PROLONG',"Продлить");
define('NB_BUT_ADD',"Добавить");
define('NB_BUT_DEL',"Удалить");
define('NB_BUT_EDIT',"Редактировать");
define('NB_BUT_UPD',"Обновить");
define('NB_BUT_RES',"Очистить");
define('NB_BUT_CANS',"Отменить");
define('NB_BUT_AGR',"Принять");
define('NB_BUT_SEA',"Найти");
/*--------------yes no----------------------------*/
define('NB_SEL_YES',"Да");
define('NB_SEL_NO',"Нет");
/*--------------messeg----------------------------*/
define('NB_MES_START',"Не сконфигурирована ни одна категория объявлений, пожалуйста, обратитесь к администратору сайта.");
define('NB_MES_00',"Сообщение");
define('NB_MES_01',"Не выбрана запись для редактирования");
define('NB_MES_02',"Не выбрана запись для удаления");
define('NB_MES_03',"Вы действительно хотите удалить категорию");
define('NB_MES_04',"Вы пытаетесь добавить пустую категорию!");
define('NB_MES_05',"Категория успешно добавлена");
define('NB_MES_06',"Категория обновлена");
define('NB_MES_07',"Категория");
define('NB_MES_08',"удалена");
define('NB_MES_09',"Неправильный формат номера страницы!");
define('NB_MES_10',"Неправильный запрос к базе.");
define('NB_MES_11',"Вы пытаетесь добавить пустую подкатегорию!");
define('NB_MES_12',"Подкатегория успешно добавлена");
define('NB_MES_13',"Под-категория обновлена");
define('NB_MES_14',"Настройки обновлены");
define('NB_MES_15',"Без картинки");
define('NB_MES_16',"Введите ваше имя, не более 20 символов!");
define('NB_MES_17',"Установки обновлены");
define('NB_MES_18',"Установки добавлены");
define('NB_MES_19',"Ваше объявление успешно добавлено!");
define('NB_MES_20',"Ваше объявление добавлено сроком до ");
define('NB_MES_21',"Заполните пожалуйста все поля отмеченные знаком *");
define('NB_MES_22',"Объявление обновлено");
define('NB_MES_23',"Информация о баннере обновлена!");
define('NB_MES_24',"Объявление удалено");
define('NB_MES_30',"Ваше объявление продлено, и будет действительно еще ");
define('NB_MES_31',"дней! В любом случае, вы можете поднять его вверх в любое время.");
/*--------------example----------------------------*/
define('NB_EX_CONF_01',"Сколько будет 4+4");
define('NB_EX_CONF_02',"8");
define('NB_EX_CAT_01',"Авто");
define('NB_EX_CATDESC_01',"Автомобили, мотоциклы, запчасти");
define('NB_EX_CAT_02',"Недвижимость");
define('NB_EX_CATDESC_02',"Квартиры, дома, дачи, офисы");
define('NB_EX_CAT_03',"Цифра");
define('NB_EX_CATDESC_03',"Компьютеры, телефоны, спутниквое оборудование");
define('NB_EX_CAT_04',"Люди");
define('NB_EX_CATDESC_04',"Знакомства, объявления о работе, вакансии");
define('NB_EX_CAT_05',"продажа");
define('NB_EX_CAT_06',"покупка");
define('NB_EX_CAT_07',"обмен");
define('NB_EX_CAT_08',"аренда");
define('NB_EX_CAT_09',"ищу, познакомлюсь");
define('NB_EX_CAT_10',"вакансии");
define('NB_EX_CAT_11',"предлагаю работу");
?>