<?php
define("ALTRANK_AUTOR", "Николай Нинков ( Ники в e107.bg )");
define("ALTRANK_DESC", "Този модул позволява на администраторите да дават/отнемат допълнителни рангове на потребителите със картинки.");
define("ALTRANK_00", "Алтернативни рангове");
define("ALTRANK_01", "Прави авторски клипове");
define("ALTRANK_02", "Пише коментари с висока оценка");
define("ALTRANK_03", "Доверен потребител");
define("ALTRANK_04", "Администратор/Модератор на голяма група");
define("ALTRANK_05", "Често посещаван профил");
define("ALTRANK_06", "Помага за развитието на сайта");
define("ALTRANK_07", "Пише хубави субтитри");
define("ALTRANK_08", "Член на екипа за поддръжка на сайта");
define("ALTRANK_09", "Официален профил");
define("ALTRANK_10", "Качва интересни клипове с висока оценка");
define("ALTRANK_DONE", "Модулът Алтернативни рангове е успешно инсталиран");
define("ALTRANK_UPGR_DONE", "Модулът Алтернативни рангове е успешно обновен");