<?php
// ------------------------------------------------------------------------- //
//  Coppermine Photo Gallery v1.2.0                                          //
// ------------------------------------------------------------------------- //
//  Copyright (C) 2002  Grégory DEMAR <gdemar@wanadoo.fr>                    //
//  http://www.chezgreg.net/coppermine/                                      //
// ------------------------------------------------------------------------- //
//  Based on PHPhotoalbum by Henning Støverud <henning@stoverud.com>         //
//  http://www.stoverud.com/PHPhotoalbum/                                    //
// ------------------------------------------------------------------------- //
//  This program is free software; you can redistribute it and/or modify     //
//  it under the terms of the GNU General Public License as published by     //
//  the Free Software Foundation; either version 2 of the License, or        //
//  (at your option) any later version.                                      //
// ------------------------------------------------------------------------- //

// info about translators and translated language 
$lang_translation_info = array( 
'lang_name_english' => 'Russian',  //the name of your language in English, e.g. 'Greek' or 'Spanish' 
'lang_name_native' => 'Ðóññêèé', //the name of your language in your mother tongue (for non-latin alphabets, use unicode) 
'lang_country_code' => 'ru', //the two-letter code for the country your language is most-often spoken (refer to http://www.iana.org/cctld/cctld-whois.htm), e.g. 'gr' or 'es' 
'trans_name'=> 'Ejik', //the name of the translator - can be a nickname 
'trans_email' => 'ejik@rbcmail.ru', //translator's email address (optional) 
'trans_website' => 'http://counterstrike.ru', //translator's website (optional) 
'trans_date' => '2003-11-03', //the date the translation was created / last modified 
); 

$lang_charset = 'windows-1251';
$lang_text_dir = 'ltr'; // ('ltr' for left to right, 'rtl' for right to left)

// shortcuts for Byte, Kilo, Mega
$lang_byte_units = array('Áàéò', 'KB', 'MB');

// Day of weeks and months
$lang_day_of_week = array('Âñê', 'Ïîí', 'Âòîð', 'Ñðåäà', '×åò', 'Ïÿò', 'Ñóá');
$lang_month = array('ßíâ', 'Ôåâð', 'Ìàðò', 'Àïð', 'Ìàé', 'Èþíü', 'Èþëü', 'Àâã', 'Ñåíò', 'Îêò', 'Íîÿáðü', 'Äåê');

// Some common strings
$lang_yes = 'Äà';
$lang_no  = 'Íåò';
$lang_back = 'Íàçàä';
$lang_continue = 'Âïåðåä';
$lang_info = 'Èíôîðìàöèÿ';
$lang_error = 'Îøèáêà';

// The various date formats
// See http://www.php.net/manual/en/function.strftime.php to define the variable below
$album_date_fmt =    '%d %B %Yã.';
$lastcom_date_fmt =  '%d %B %Yã. â %H:%M';
$lastup_date_fmt = '%d.%m.%Yã.';
$register_date_fmt = '%d %B %Yã.';
$lasthit_date_fmt = '%d %B %Yã. â %I:%M';
$comment_date_fmt =  '%d %B %Yã. â %H:%M';

// For the word censor
$lang_bad_words = array('*fuck*', 'asshole', 'assramer', 'bitch*', 'c0ck', 'clits', 'Cock', 'cum', 'cunt*', 'dago', 'daygo', 'dego', 'dick*', 'dildo', 'fanculo', 'feces', 'foreskin', 'Fu\(*', 'fuk*', 'honkey', 'hore', 'injun', 'kike', 'lesbo', 'masturbat*', 'motherfucker', 'nazis', 'nigger*', 'nutsack', 'penis', 'phuck', 'poop', 'pussy', 'scrotum', 'shit', 'slut', 'titties', 'titty', 'twaty', 'wank*', 'whore', 'wop*',
			'*ïèçä*', '*õóé*', '*çàåá*', '*ïèäàð*', '*æîïà*', '*óðîä*','*êîçë*','*áëÿ*','*õóå*');

$lang_meta_album_names = array( 
        'random' => 'Ñëó÷àéíûå ôîòî', 
        'lastup' => 'Ïîñëåäíèé äîáàâëåíèÿ', 
        'lastalb'=> 'Ïîñëåäíåå îáíîâëåíèå àëüáîìà', 
        'lastcom' => 'Ïîñëåäíèå êîììåíòàðèè', 
        'topn' => '×àñòî ïðîñìàòðèâàåìûå', 
        'toprated' => 'Ëó÷øèå ïî ðåéòèíãó', 
        'lasthits' => 'Ïîñëåäíèå ïðîñìîòðåííûå', 
        'search' => 'Ðåçóëüòàòû ïîèñêà', 
        'favpics'=> 'Èçáðàííûå',
);

$lang_errors = array(
	'access_denied' => 'Ó Âàñ íåò ïðàâ äëÿ ïðîñìîòðà ýòîé ñòðàíèöû.',
	'perm_denied' => 'Ó Âàñ íåò ïðàâ íà âûïîëíåíèå ýòîé îïåðàöèè.',
	'param_missing' => 'Ñêðèïò âûçâàí áåç òðåáóåìûõ ïàðàìåòðîâ',
	'non_exist_ap' => 'Âûáðàííûé àëüáîì/ôîòî íå ñóùåñòâóåò !',
	'quota_exceeded' => 'Äèñêîâàÿ êâîòà ïðåâûøåíà<br /><br />Äëÿ Âàñ äèñêîâàÿ êâîòà ñîñòàâëÿåò [quota]Ká. Âàøè ôîòî ñåé÷àñ çàíèìàþò [space]Ká. Äîáàâëåíèå ýòîãî ôîòî ïðåâûñÿò Âàøó êâîòó.',
	'gd_file_type_err' => 'Êîãäà èñïîëüçóåòå áèáëèîòåêó GD - ðàçðåøåííûå òèïû èçîáðàæåíèé òîëüêî JPEG è PNG.',
	'invalid_image' => 'Çàãðóæåííîå Âàìè ôîòî èñïîð÷åíî èëè íå ìîæåò áûòü îáðàáîòàíî áèáëèîòåêîé GD',
	'resize_failed' => 'Íåâîçìîæíî ñîçäàòü ýñêèç èëè óìåíüøèòü ðàçìåð ôîòî.',
	'no_img_to_display' => 'Íåò ôîòî',
	'non_exist_cat' => 'Âûáðàííàÿ êàòåãîðèÿ íå ñóùåñòâóåò',
	'orphan_cat' => 'Êàòåãîðèÿ èìååò íå ñóùåñòâóþùåãî \'ãîëîâíîãî êàòàëîãà\'. Çàïóñòèòå Ìåíåäæåð êàòàëîãîâ äëÿ èñïðàâëåíèÿ ïðîáëåìû.',
	'directory_ro' => 'Ïàïêà \'%s\' òîëüêî äëÿ ÷òåíèÿ, ôîòîãðàôèè íå ìîãóò áûòü óäàëåíû',
	'non_exist_comment' => 'Âûáðàííûé êîììåíòàðèé íå ñóùåñòâóåò.',
	'pic_in_invalid_album' => 'Ôîòî èç íåñóùåñòâóþùåãî àëüáîìà (%s)!?',
        'banned' => 'Âû çàáàíåíû íà ýòîì ñàéòå.', 
        'not_with_udb' => 'Ýòà ôóíêöèÿ âûêëþ÷åíà â Coppermine, ïîòîìó÷òî îáúåäèíåíà ñ ôîðóìîì. Èëè òî, ÷òî âû ïûòàåòåñü ñäåëàòü, íå ïîääåðæèâàåòñÿ â ýòîé êîíôèãóðàöèè, èëè ýòà ôóíêöèÿ äîëæíû áûòü îáðàáîòàíà ôîðóìîì.', 
);

// ------------------------------------------------------------------------- //
// File theme.php
// ------------------------------------------------------------------------- //

$lang_main_menu = array(
	'alb_list_title' => 'Ê ñïèñêó àëüáîìà',
	'alb_list_lnk' => 'Ñïèñîê êàòåãîðèé',
	'my_gal_title' => 'Â ïåðñîíàëüíóþ ãàëåðåþ',
	'my_gal_lnk' => 'Ìîÿ ãàëåðåÿ',
	'my_prof_lnk' => 'Ïðîôèëü',
	'adm_mode_title' => 'Ïåðåêëþ÷èòüñÿ â ðåæèì àäìèíèñòðàòîðà',
	'adm_mode_lnk' => 'Ðåæèì àäìèíèñòðàòîðà',
	'usr_mode_title' => 'Ïåðåêëþ÷èòüñÿ â ðåæèì ïîëüçîâàòåëÿ',
	'usr_mode_lnk' => 'Ðåæèì ïîëüçîâàòåëÿ',
	'upload_pic_title' => 'Äîáàâëåíèå ôîòî â àëüáîì',
	'upload_pic_lnk' => 'Äîáàâèòü ôîòî',
	'register_title' => 'Çàðåãèñòðèðîâàòüñÿ',
	'register_lnk' => 'Ðåãèñòðàöèÿ',
	'login_lnk' => 'Âîéòè',
	'logout_lnk' => 'Âûéòè',
	'lastup_lnk' => 'Ïîñëåäíèå äîáàâëåíèÿ',
	'lastcom_lnk' => 'Ïîñëåäíèå êîììåíòàðèè',
	'topn_lnk' => '×àñòî ïðîñìàòðèâàåìûå',
	'toprated_lnk' => 'Ëó÷øèå ïî ðåéòèíãó',
	'search_lnk' => 'Ïîèñê',
        'fav_lnk' => 'Èçáðàííûå', 
);

$lang_gallery_admin_menu = array(
	'upl_app_lnk' => 'Ïðîâåðêà äîáàâëåíèé',
	'config_lnk' => 'Íàñòðîéêè',
	'albums_lnk' => 'Àëüáîìû',
	'categories_lnk' => 'Êàòåãîðèè',
	'users_lnk' => 'Ïîëüçîâàòåëè',
	'groups_lnk' => 'Ãðóïïû',
	'comments_lnk' => 'Êîììåíòàðèè',
	'searchnew_lnk' => 'Àâòî äîáàâëåíèå',
        'util_lnk' => 'Èçìåíèòü ðàçìåð', //new in cpg1.2.0
        'ban_lnk' => 'Áàí ïîëüçîâàòåëåé',//new in cpg1.2.0
);

$lang_user_admin_menu = array(
	'albmgr_lnk' => 'Ñîçäàòü/óïîðÿäî÷èòü ìîè àëüáîìû',
	'modifyalb_lnk' => 'Ïðàâèòü ìîè àëüáîìû',
	'my_prof_lnk' => 'Ïðîôèëü',
);

$lang_cat_list = array(
	'category' => 'Êàòåãîðèÿ',
	'albums' => 'Àëüáîìîâ',
	'pictures' => 'Ôîòî',
);

$lang_album_list = array(
	'album_on_page' => '%d àëüáîìîâ íà %d ñòðàíèöàõ'
);

$lang_thumb_view = array(
	'date' => 'Äàòà',
        //Sort by filename and title
        'name' => 'Èìÿ ôàèëà', //new in cpg1.2.0
        'title' => 'Íàçâàíèå',//new in cpg1.2.0
	'sort_da' => 'Ñîðò. ïî äàòå [âîçðàñòàíèå]',
	'sort_dd' => 'Ñîðò. ïî äàòå [óáûâàíèå]',
	'sort_na' => 'Ñîðò. ïî èìåíè [âîçðàñòàíèå]',
	'sort_nd' => 'Ñîðò. ïî èìåíè [óáûâàíèå]',
        'sort_ta' => 'Ñîðò. ïî íàçâàíèþ [âîçâðàñòàíèå]', 
        'sort_td' => 'Ñîðò. ïî íàçâàíèþ [óáûâàíèå]',  //new in cpg1.2.0
	'pic_on_page' => '%d ôîòî íà %d ñòðàíèöå(àõ)',
	'user_on_page' => '%d ïîëüçîâàòåëåé íà %d ñòðàíèöå(àõ)'
);

$lang_img_nav_bar = array(
	'thumb_title' => 'Âåðíóòüñÿ íà ñòðàíèöó ñ ýñêèçîì',
	'pic_info_title' => 'Ïîêàçàòü/ñêðûòü èíôîðìàöèþ î ôîòî',
	'slideshow_title' => 'Ñëàéä-øîó',
	'ecard_title' => 'Ïîñëàòü ýòî ôîòî êàê eCard',
	'ecard_disabled' => 'eCards îòêëþ÷åíû',
	'ecard_disabled_msg' => 'Ó Âàñ íåò ïðàâ íà îòïðàâêó eCards',
	'prev_title' => 'Ñìîòðåòü ïðåäûäóþùåå ôîòî',
	'next_title' => 'Ñìîòðåòü ñëåäóþùåå ôîòî',
	'pic_pos' => 'ÔÎÒÎ %s èç %s',
);

$lang_rate_pic = array(
	'rate_this_pic' => 'Îöåíèòü ýòî ôîòî',
	'no_votes' => '(Íå ãîëîñîâàëè)',
	'rating' => '(òåêóùèé ðåéòèíã: %s èç 5 ñ %s ãîëîñàìè)',
	'rubbish' => 'Íèêàê',
	'poor' => 'Î÷åíü ïëîõî',
	'fair' => 'Ïëîõî',
	'good' => 'Ñðåäíå',
	'excellent' => 'Õîðîøî',
	'great' => 'Îòëè÷íî',
);

// ------------------------------------------------------------------------- //
// File include/exif.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/functions.inc.php
// ------------------------------------------------------------------------- //

$lang_cpg_die = array(
	INFORMATION => $lang_info,
	ERROR => $lang_error,
	CRITICAL_ERROR => 'Êðèòè÷åñêàÿ îøèáêà',
	'file' => 'Ôàéë: ',
	'line' => 'Ñòðîêà: ',
);

$lang_display_thumbnails = array(
	'filename' => 'Ôàéë : ',
	'filesize' => 'Ðàçìåð ôàéëà: ',
	'dimensions' => 'Ðàçìåðû : ',
	'date_added' => 'Äàòà äîáàâëåíèÿ : '
);

$lang_get_pic_data = array(
	'n_comments' => '%s êîììåíòàðèåâ',
	'n_views' => '%s ïðîñìîòðîâ',
	'n_votes' => '(%s ãîëîñîâ)'
);

// ------------------------------------------------------------------------- //
// File include/init.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/picmgmt.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/smilies.inc.php
// ------------------------------------------------------------------------- //

if (defined('SMILIES_PHP')) $lang_smilies_inc_php = array(
	'Exclamation' => 'Exclamation',
	'Question' => 'Question',
	'Very Happy' => 'Very Happy',
	'Smile' => 'Smile',
	'Sad' => 'Sad',
	'Surprised' => 'Surprised',
	'Shocked' => 'Shocked',
	'Confused' => 'Confused',
	'Cool' => 'Cool',
	'Laughing' => 'Laughing',
	'Mad' => 'Mad',
	'Razz' => 'Razz',
	'Embarassed' => 'Embarassed',
	'Crying or Very sad' => 'Crying or Very sad',
	'Evil or Very Mad' => 'Evil or Very Mad',
	'Twisted Evil' => 'Twisted Evil',
	'Rolling Eyes' => 'Rolling Eyes',
	'Wink' => 'Wink',
	'Idea' => 'Idea',
	'Arrow' => 'Arrow',
	'Neutral' => 'Neutral',
	'Mr. Green' => 'Mr. Green',
);

// ------------------------------------------------------------------------- //
// File addpic.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File admin.php
// ------------------------------------------------------------------------- //

if (defined('ADMIN_PHP')) $lang_admin_php = array(
	0 => 'Âûõîä èç ðåæèìà àäìèíèñòðàòîðà ...',
	1 => 'Âõîä â ðåæèì àäìèíèñòðàòîðà ...',
);

// ------------------------------------------------------------------------- //
// File albmgr.php
// ------------------------------------------------------------------------- //

if (defined('ALBMGR_PHP')) $lang_albmgr_php = array(
	'alb_need_name' => 'Àëüáîì äîëæåí èìåòü íàçâàíèå!',
	'confirm_modifs' => 'Âû óâåðåíû, ÷òî õîòèòå ñäåëàòü ýòè èçìåíåíèÿ?',
	'no_change' => 'Âû íè÷åãî íå èçìåíèëè!',
	'new_album' => 'Íîâûé àëüáîì',
	'confirm_delete1' => 'Âû äåéñòâèòåëüíî õîòèòå óäàëèòü ýòîò àëüáîì?',
	'confirm_delete2' => '\nÂñå ôîòî è êîììåíòàðèè èñ÷åçíóò!',
	'select_first' => 'Ñíà÷àëà âûáåðèòå àëüáîì',
	'alb_mrg' => 'Óïðàâëåíèå àëüáîìàìè',
	'my_gallery' => '* Ìîÿ ãàëåðåÿ *',
	'no_category' => '* Íåò êàòåãîðèè *',
	'delete' => 'Óäàëèòü',
	'new' => 'Íîâûé',
	'apply_modifs' => 'Ïðèìåíèòü èçìåíåíèÿ'
);

// ------------------------------------------------------------------------- //
// File catmgr.php
// ------------------------------------------------------------------------- //

if (defined('CATMGR_PHP')) $lang_catmgr_php = array(
	'miss_param' => 'Ïàðàìåòðû, òðåáóåìûå äëÿ âûïîëíåíèÿ îïåðàöèè \'%s\', íå ïðåäîñòàâëåíû!',
	'unknown_cat' => 'Âûáðàííàÿ êàòåãîðèÿ íå ñóùåñòâóåò â áàçå',
	'usergal_cat_ro' => 'Êàòåãîðèÿ ïîëüçîâàòåëüñêèõ ãàëåðåé íå ìîæåò áûòü óäàëåíà!',
	'manage_cat' => 'Óïðàâëåíèå êàòåãîðèÿìè',
	'confirm_delete' => 'Âû äåéñòâèòåëüíî õîòèòå ÓÄÀËÈÒÜ ýòó êàòåãîðèþ?',
	'category' => 'Êàòåãîðèÿ',
	'operations' => 'Äåéñòâèÿ',
	'move_into' => 'Ïåðåìåñòèòü â',
	'update_create' => 'Îáíîâèòü/Ñîçäàòü êàòåãîðèþ',
	'parent_cat' => 'Êàòåãîðèÿ âåðõíåãî óðîâíÿ',
	'cat_title' => 'Çàãîëîâîê êàòåãîðèè',
	'cat_desc' => 'Îïèñàíèå êàòåãîðèè'
);

// ------------------------------------------------------------------------- //
// File config.php
// ------------------------------------------------------------------------- //

if (defined('CONFIG_PHP')) $lang_config_php = array(
	'title' => 'Êîíôèãóðàöèÿ',
	'restore_cfg' => 'Âîññòàíîâèòü çíà÷åíèÿ ïî óìîë÷àíèþ',
	'save_cfg' => 'Ñîõðàíèòü íîâóþ êîíôèãóðàöèþ',
	'notes' => 'Ïðèìå÷àíèÿ',
	'info' => 'Èíôîðìàöèÿ',
	'upd_success' => 'Êîíôèãóðàöèÿ îáíîâëåíà',
	'restore_success' => 'Êîíôèãóðàöèÿ ïî óìîë÷àíèþ âîññòàíîâëåíà',
	'name_a' => 'èìåíè [âîçðàñòàíèå]',
	'name_d' => 'èìåíè [óáûâàíèå]',
        'title_a' => 'Íàçâàíèå [âîçâðàñòàíèå]', 
        'title_d' => 'Íàçâàíèå [óûâàíèå]',
	'date_a' => 'äàòå [âîçðàñòàíèå]',
	'date_d' => 'äàòå [óáûâàíèå]',
        'th_any' => 'Max Aspect',
        'th_ht' => 'Âûñîòà',
        'th_wd' => 'Øèðèíà',
);

if (defined('CONFIG_PHP')) $lang_config_data = array(
	'Îáùèå íàñòðîéêè',
	array('Íàçâàíèå ãàëåðåè', 'gallery_name', 0),
	array('Îïèñàíèå ãàëåðåè', 'gallery_description', 0),
	array('eMail àäìèíèñòðàòîðà ãàëåðåè', 'gallery_admin_email', 0),
	array('Àäðåñ äëÿ ññûëêè \'Ñì. äîïîëíèòåëüíûå ôîòî\' â eCards', 'ecards_more_pic_target', 0),
	array('ßçûê', 'lang', 5),
	array('Òåìà', 'theme', 6),

	'Ïðîñìîòð ñïèñêà àëüáîìîâ',
	array('Øèðèíà ãëàâíîé òàáëèöû (ïèêñåëîâ èëè %)', 'main_table_width', 0),
	array('Êîëè÷åñòâî óðîâíåé êàòåãîðèé äëÿ ïîêàçà', 'subcat_level', 0),
	array('Êîëè÷åñòâî àëüáîìîâ äëÿ ïîêàçà', 'albums_per_page', 0),
	array('Êîëè÷åñòâî êîëîíîê äëÿ ñïèñêà àëüáîìîâ', 'album_list_cols', 0),
	array('Ðàçìåð ýñêèçîâ â ïèêñåëàõ', 'alb_list_thumb_size', 0),
	array('Ñîäåðæèìîå ãëàâíîé ñòðàíèöû', 'main_page_layout', 0),
        array('Ïîêàçàòü ñíà÷àëà ïåðâûé óðîâåíü ýêñèçà â êàòåãîðèÿõ','first_level',1),  //new in cpg1.2.0

	'Ïðîñìîòð ýñêèçîâ',
	array('Êîëè÷åñòâî êîëîíîê íà ñòðàíèöå ñ ýñêèçàìè', 'thumbcols', 0),
	array('Êîëè÷åñòâî ñòðîê íà ñòðàíèöå ñ ýñêèçàìè', 'thumbrows', 0),
	array('Ìàêñ. êîë-âî ïîêàçûâàåìûõ çàêëàäîê', 'max_tabs', 0),
	array('Ïîêàçûâàòü íàäïèñü ôîòî (â äîïîëíåíèå ê çàãîëîâêó) ïîä ýñêèçîì', 'caption_in_thumbview', 1),
	array('Ïîêàçûâàòü êîë-âî êîììåíòàðèåâ ïîä ýñêèçîì', 'display_comment_count', 1),
	array('Ïîðÿäîê ñîðòèðîâêè äëÿ ôîòî ïî óìîë÷àíèþ', 'default_sort_order', 3),
	array('Ìèíèìàëüíîå êîë-âî ãîëîñîâ äëÿ ôîòî äëÿ ïîÿâëåíèÿ â ñïèñêå \'ëó÷øèõ ïî ðåéòèíãó\'', 'min_votes_for_rating', 0),

	'Ïðîñìîòð ôîòî &amp; Íàñòðîéêè êîììåíòàðèÿ',
	array('Äëèíà òàáëèöû äëÿ ïîêàçà ôîòî (ïèêñåëîâ èëè %)', 'picture_table_width', 0),
	array('Ïî óìîë÷àíèþ èíôîðìàöèÿ î ôîòî âèäíà', 'display_pic_info', 1),
	array('Ôèëüòðîâàòü ïëîõèå ñëîâà â êîììåíòàðèÿõ', 'filter_bad_words', 1),
	array('Ðàçðåøèòü ñìàéëèêè â êîììåíòàðèÿõ', 'enable_smilies', 1),
	array('Ìàêñ. äëèíà äëÿ îïèñàíèÿ ôîòî', 'max_img_desc_length', 0),
	array('Ìàêñ. êîëè÷åñòâî ñèìâîëîâ â ñëîâå', 'max_com_wlength', 0),
	array('Ìàêñ. êîëè÷åñòâî ñòðîê â êîììåíòàðèè', 'max_com_lines', 0),
	array('Ìàêñ. äëèíà êîììåíòàðèÿ', 'max_com_size', 0),
        array('Ïîêàçûâàòü ëåíòó êàðòèíîê', 'display_film_strip', 1), 
        array('Êîëè÷åñòâî êàðòèíîê â ëåíòå', 'max_film_strip_items', 0), 

	'Íàñòðîéêè ôîòî è ýñêèçîâ',
	array('Êà÷åñòâî äëÿ JPEG ôàéëîâ', 'jpeg_qual', 0),
	array('Ìàêñ. äëèíà èëè âûñîòà ýñêèçà <b>*</b>', 'thumb_width', 0),
        array('Èñïîëüçîâàòü ðàçìåð ( äëèííà èëè âûñîòà èëè ìàêñèìàëüíàÿ ñòîðîíà ýêñèçà )<b>*</b>', 'thumb_use', 7),  //new in cpg1.2.0
	array('Ñîçäàâàòü ïðîìåæóòî÷íîå ôîòî','make_intermediate',1),
	array('Ìàêñ. äëèíà èëè âûñîòà ïðîìåæóòî÷íîãî ôîòî <b>*</b>', 'picture_width', 0),
	array('Ìàêñ. ðàçìåð äëÿ äîáàâëÿåìûõ ôîòî (Ká)', 'max_upl_size', 0),
	array('Ìàêñ. äëèíà èëè âûñîòà äëÿ äîáàâëÿåìûõ ôîòî (ïèêñåëîâ)', 'max_upl_width_height', 0),

	'Íàñòðîéêè ïîëüçîâàòåëÿ',
	array('Ðàçðåøèòü ðåãèñòðàöèþ íîâûõ ïîëüçîâàòåëåé', 'allow_user_registration', 1),
	array('Ðåãèñòðàöèÿ ïîëüçîâàòåëÿ òðåáóåò ïðîâåðêè eMail', 'reg_requires_valid_email', 1),
	array('Ðàçðåøèòü äâóì ïîëüçîâàòåëÿì èìåòü îäèíàêîâûå eMail àäðåñà', 'allow_duplicate_emails_addr', 1),
	array('Ïîëüçîâàòåëè ìîãóò èìåòü ñîáñòâåííûå àëüáîìû', 'allow_private_albums', 1),

	'Ïðîèçâîëüíûå ïîëÿ äëÿ îïèñàíèÿ ôîòî (îñòàâüòå ïóñòûìè, åñëè íå èñïîëüçóåòå)',
	array('Èìÿ Ïîëÿ 1', 'user_field1_name', 0),
	array('Èìÿ Ïîëÿ 2', 'user_field2_name', 0),
	array('Èìÿ Ïîëÿ 3', 'user_field3_name', 0),
	array('Èìÿ Ïîëÿ 4', 'user_field4_name', 0),

	'Ðàñøèðåííûå íàñòðîéêè ôîòî è ýñêèçîâ',
        array('Ïîêàçàòü ñîáñòâåííûé àëüáîì íåçàðåãèñòðèðîâàííîìó ïîëüçîâàòåëþ','show_private',1),  //new in cpg1.2.0
	array('Ñèìâîëû, çàïðåùåííûå â èìåíàõ ôàéëîâ', 'forbiden_fname_char',0),
	array('Äîáàâëÿòü ôîòî ñ ðàñøèðåíèÿìè:', 'allowed_file_extensions',0),
	array('Ìåòîä èçìåíåíèÿ ðàçìåðà ôîòî','thumb_method',2),
	array('Ïóòü äî óòèëèòû \'convert\' îò ImageMagick (ïðèìåð: /usr/bin/X11/)', 'impath', 0),
	array('Ðàçðåøåííûå òèïû ôîòî (ïîäõîäèò òîëüêî äëÿ ImageMagick)', 'allowed_img_types',0),
	array('Îïöèè êîìàíäíîé ñòðîêè äëÿ ImageMagick', 'im_options', 0),
	array('×èòàòü EXIF-äàííûå â ôàéëàõ JPEG', 'read_exif_data', 1),
	array('Ïàïêà äëÿ àëüáîìà <b>*</b>', 'fullpath', 0),
	array('Ïàïêà äëÿ ïîëüçîâàòåëüñêèõ ôîòî <b>*</b>', 'userpics', 0),
	array('Ïðåôèêñ äëÿ ïðîìåæóòî÷íûõ ôîòî <b>*</b>', 'normal_pfx', 0),
	array('Ïðåôèêñ äëÿ ýñêèçîâ <b>*</b>', 'thumb_pfx', 0),
	array('Ðåæèì äëÿ ïàïîê ïî óìîë÷àíèþ (äëÿ *nix ñèñòåì)', 'default_dir_mode', 0),
	array('Ðåæèì äëÿ ôîòî ïî óìîë÷àíèþ (äëÿ *nix ñèñòåì)', 'default_file_mode', 0),

	'Cookies &amp; íàñòðîéêè êîäîâîé ñòðàíèöû',
	array('Èìÿ cookie, èñïîëüçóåìîå ñêðèïòîì', 'cookie_name', 0),
	array('Ïóòü äëÿ cookie, èñïîëüçóåìûé ñêðèïòîì', 'cookie_path', 0),
	array('Êîäèðîâêà ñèìâîëîâ', 'charset', 4),

	'Äîïîëíèòåëüíûå óñòàíîâêè',
	array('Âêëþ÷èòü ðåæèì îòëàäêè', 'debug_mode', 1),

	'<br /><div align="center">(*) Ïîëÿ, ïîìå÷åííûå * íå äîëæíû èçìåíÿòüñÿ, åñëè ó Âàñ óæå åñòü ôîòî â ãàëåðåå</div><br />'
);

// ------------------------------------------------------------------------- //
// File db_input.php
// ------------------------------------------------------------------------- //

if (defined('DB_INPUT_PHP')) $lang_db_input_php = array(
	'empty_name_or_com' => 'Âàì íóæíî íàáðàòü Âàøå èìÿ è êîììåíòàðèé',
	'com_added' => 'Âàø êîììåíòàðèé äîáàâëåí',
	'alb_need_title' => 'Âû äîëæíû óêàçàòü çàãîëîâîê àëüáîìà!',
	'no_udp_needed' => 'Îáíîâëåíèå íå òðåáóåòñÿ.',
	'alb_updated' => 'Àëüáîì îáíîâëåí',
	'unknown_album' => 'Âûáðàííûé àëüáîì íå ñóùåñòâóåò èëè ó Âàñ íåò ïðàâ äëÿ äîáàâëåíèÿ â ýòîò àëüáîì',
	'no_pic_uploaded' => 'Ôîòî íå äîáàâëåíû!<br /><br />Åñëè Âû äåéñòâèòåëüíî âûáðàëè ôîòî äëÿ äîáàâëåíèÿ, ïðîâåðüòå ñåðâåð íà âîçìîæíîñòü äîáàâëåíèÿ ôîòî ...',
	'err_mkdir' => 'Îøèáêà ïðè ñîçäàíèè ïàïêè %s !',
	'dest_dir_ro' => 'Ïàïêà íàçíà÷åíèÿ %s òîëüêî äëÿ ÷òåíèÿ (äëÿ ñêðèïòà)!',
	'err_move' => 'Íåâîçìîæíî ïåðåìåñòèòü %s â %s !',
	'err_fsize_too_large' => 'Ðàçìåð ôîòî, êîòîðîå Âû õîòèòå äîáàâèòü, ñëèøêîì áîëüøîé (ìàêñèìàëüíî äîïóñòèìûé: %s x %s) !',
	'err_imgsize_too_large' => 'Ðàçìåð ôàéëà, êîòîðûé Âû õîòèòå äîáàâèòü, ñëèøêîì áîëüøîé (ìàêñèìàëüíî äîïóñòèìûé: %s Ká) !',
	'err_invalid_img' => 'Ôàéë, êîòîðûé Âû õîòèòå äîáàâèòü ÿâëÿåòñÿ íåïðàâèëüíîé êàðòèíêîé !',
	'allowed_img_types' => 'Âû ìîæåòå äîáàâèòü òîëüêî %s ôîòî.',
	'err_insert_pic' => 'Ôîòî \'%s\' íå ìîæåò áûòü äîáàâëåíî â àëüáîì ',
	'upload_success' => 'Âàøå ôîòî óñïåøíî äîáàâëåíî<br /><br />Îíî áóäåò âèäíî ïîñëå ïðîâåðêè àäìèíèñòðàòîðîì.',
	'info' => 'Èíôîðìàöèÿ',
	'com_added' => 'Êîììåíòàðèé äîáàâëåí',
	'alb_updated' => 'Àëüáîì îáíîâëåí',
	'err_comment_empty' => 'Âàø êîììåíòàðèé ïóñòîé !',
	'err_invalid_fext' => 'Ïðèíèìàþòñÿ ôàéëû òîëüêî ñ ýòèìè ðàñøèðåíèÿìè: <br /><br />%s.',
	'no_flood' => 'Èçâèíèòå, íî Âû óæå ÿâëÿåòåñü àâòîðîì ïîñëåäíåãî êîììåíòàðèÿ äëÿ ýòîãî ôîòî<br /><br />Îòðåäàêòèðóéòå êîììåíòàðèé, êîòîðûé Âû ïîñëàëè, åñëè õîòèòå åãî èñïðàâèòü.',
	'redirect_msg' => 'Âû áóäåòå ïåðåíàïðàâëåíû.<br /><br /><br />Íàæìèòå \'ÏÐÎÄÎËÆÈÒÜ\' åñëè ñòðàíèöà íå îáíîâèòñÿ àâòîìàòè÷åñêè',
	'upl_success' => 'Âàøå ôîòî óñïåøíî äîáàâëåíî',
);

// ------------------------------------------------------------------------- //
// File delete.php
// ------------------------------------------------------------------------- //

if (defined('DELETE_PHP')) $lang_delete_php = array(
	'caption' => 'Íàäïèñü',
	'fs_pic' => 'ïîëíûé ðàçìåð ôîòî',
	'del_success' => 'óñïåøíî óäàëåíî',
	'ns_pic' => 'íîðìàëüíûé ðàçìåð ôîòî',
	'err_del' => 'íå ìîæåò áûòü óäàëåíî',
	'thumb_pic' => 'ýñêèç',
	'comment' => 'êîììåíòàðèé',
	'im_in_alb' => 'ôîòî â àëüáîìå',
	'alb_del_success' => 'Àëüáîì \'%s\' óäàëåí',
	'alb_mgr' => 'Óïðàâëåíèå àëüáîìîì',
	'err_invalid_data' => 'Íåâåðíûå äàííûå ïîëó÷åíû â \'%s\'',
	'create_alb' => 'Ñîçäàíèå àëüáîìà \'%s\'',
	'update_alb' => 'Îáíîâëåíèå àëüáîìà \'%s\' ñ çàãîëîâêîì \'%s\' è èíäåêñîì \'%s\'',
	'del_pic' => 'Óäàëèòü ôîòî',
	'del_alb' => 'Óäàëèòü àëüáîì',
	'del_user' => 'Óäàëèòü ïîëüçîâàòåëÿ',
	'err_unknown_user' => 'Âûáðàííûé ïîëüçîâàòåëü íå ñóùåñòâóåò !',
	'comment_deleted' => 'Êîììåíòàðèé áûë óñïåøíî óäàëåí',
);

// ------------------------------------------------------------------------- //
// File displayecard.php
// ------------------------------------------------------------------------- //

// Void

// ------------------------------------------------------------------------- //
// File displayimage.php
// ------------------------------------------------------------------------- //

if (defined('DISPLAYIMAGE_PHP')){

$lang_display_image_php = array(
	'confirm_del' => 'Âû óâåðåíû, ÷òî õîòèòå óäàëèòü ýòî ôîòî? \\nÊîììåíòàðèè òàêæå óäàëÿòñÿ.',
	'del_pic' => 'ÓÄÀËÈÒÜ ÔÎÒÎ',
	'size' => '%s x %s ïèêñåëîâ',
	'views' => '%s ðàç',
	'slideshow' => 'Ñëàéä-øîó',
	'stop_slideshow' => 'ÎÑÒÀÍÎÂÈÒÜ ÑËÀÉÄ-ØÎÓ',
);

$lang_picinfo = array(
	'title' =>'Èíôîðìàöèÿ î ôîòî',
	'Filename' => 'Ôàéë',
	'Album name' => 'Àëüáîì',
	'Rating' => 'Ðåéòèíã (%s ãîëîñîâ)',
	'Keywords' => 'Êëþ÷åâûå ñëîâà',
	'File Size' => 'Ðàçìåð ôàéëà',
	'Dimensions' => 'Ðàçìåðû',
	'Displayed' => 'Ïðîñìîòðîâ',
	'Camera' => 'Êàìåðà',
	'Date taken' => 'Date taken',
	'Aperture' => 'Äèàôðàãìà',
	'Exposure time' => 'Ýêñïîçèöèÿ',
	'Focal length' => 'Ôîêóñíîå ðàññòîÿíèå',
        'Comment' => 'Êîìåíòàðèé', 
        'addFav' => 'Äîáàâèòü â èçáðàííûå', 
        'addFavPhrase' => 'Èçáðàííûå', 
        'remFav' => 'Óäàëèòü èç èçáðàííûõ',  //new in cpg1.2.0
);

$lang_display_comments = array(
	'OK' => 'OK',
	'edit_title' => 'Îòðåäàêòèðîâàòü',
	'confirm_delete' => 'Òî÷íî óäàëèòü ?',
	'add_your_comment' => 'Ïðîêîììåíòèðîâàòü',
        'name' => 'Èìÿ', 
        'comment' => 'Êîììåíòàðèé', 
        'your_name' => 'Àíîíèìíî',
);

$lang_fullsize_popup = array( 
        'click_to_close' => 'Íàæìèòå íà êàðòèíêó, ÷òîáû çàêðûòü îêíî',  //new in cpg1.2.0
);

}

// ------------------------------------------------------------------------- //
// File ecard.php
// ------------------------------------------------------------------------- //

if (defined('ECARDS_PHP') || defined('DISPLAYECARD_PHP')) $lang_ecard_php =array(
	'title' => 'Ïîñëàòü eCard',
	'invalid_email' => '<b>Âíèìàíèå</b> : íåïðàâèëüíûé eMail àäðåñ !',
	'ecard_title' => 'eCard îò %s äëÿ Âàñ',
	'view_ecard' => 'Åñëè eCard ïîêàçûâàåòñÿ íåêîððåêòíî, íàæìèòå íà ýòó ññûëêó',
	'view_more_pics' => 'Íàæìèòå íà ýòó ññûëêó äëÿ ïðîñìîòðà îñòàëüíûõ ôîòî!',
	'send_success' => 'Âàøà eÑard ïîñëàíà',
	'send_failed' => 'Èçâèíèòå, íî ñåðâåð íå ìîæåò ïîñëàòü Âàøó eCard...',
	'from' => 'Îò',
	'your_name' => 'Âàøå èìÿ',
	'your_email' => 'Âàø eMail àäðåñ',
	'to' => 'Êîìó',
	'rcpt_name' => 'Èìÿ ïîëó÷àòåëÿ',
	'rcpt_email' => 'eMail àäðåñ ïîëó÷àòåëÿ',
	'greetings' => 'Ïðèâåòñòâèå',
	'message' => 'Ñîîáùåíèå',
);

// ------------------------------------------------------------------------- //
// File editpics.php
// ------------------------------------------------------------------------- //

if (defined('EDITPICS_PHP')) $lang_editpics_php = array(
	'pic_info' => 'Èíôîðìàöèÿ î ôîòî',
	'album' => 'Àëüáîì',
	'title' => 'Çàãîëîâîê',
	'desc' => 'Îïèñàíèå',
	'keywords' => 'Êëþ÷åâûå ñëîâà',
	'pic_info_str' => '%sx%s - %sÊá - %s ïðîñìîòðîâ - %s ãîëîñîâ',
	'approve' => 'Îäîáðèòü ôîòî',
	'postpone_app' => 'Îòìåíèòü îäîáðåíèå',
	'del_pic' => 'Óäàëèòü ôîòî',
	'reset_view_count' => 'Ñáðîñèòü ñ÷åò÷èê ïðîñìîòðîâ',
	'reset_votes' => 'Ñáðîñèòü ãîëîñà',
	'del_comm' => 'Óäàëèòü êîììåíòàðèè',
	'upl_approval' => 'Ïðîâåðêà äîáàâëåíèé',
	'edit_pics' => 'Ïðàâèòü ôîòî',
	'see_next' => 'Ñìîòðåòü ñëåäóþùåå ôîòî',
	'see_prev' => 'Ñìîòðåòü ïðåäûäóþùåå ôîòî',
	'n_pic' => '%s ôîòî',
	'n_of_pic_to_disp' => 'Êîë-âî ôîòî íà ýêðàí',
	'apply' => 'Ïðèìåíèòü èçìåíåíèÿ'
);

// ------------------------------------------------------------------------- //
// File groupmgr.php
// ------------------------------------------------------------------------- //

if (defined('GROUPMGR_PHP')) $lang_groupmgr_php = array(
	'group_name' => 'Èìÿ ãðóïïû',
	'disk_quota' => 'Äèñêîâàÿ êâîòà',
	'can_rate' => 'Ìîãóò îöåíèâàòü ôîòî',
	'can_send_ecards' => 'Ìîãóò ïîñûëàòü eCards',
	'can_post_com' => 'Ìîãóò äîáàâëÿòü êîììåíòàðèè',
	'can_upload' => 'Ìîãóò äîáàâëÿòü ôîòî',
	'can_have_gallery' => 'Ìîãóò èìåòü ïåðñîíàëüíûå ãàëåðåè',
	'apply' => 'Ïðèìåíèòü èñïðàâëåíèÿ',
	'create_new_group' => 'Ñîçäàòü íîâóþ ãðóïïó',
	'del_groups' => 'Óäàëèòü âûáðàííóþ ãðóïïó(û)',
	'confirm_del' => 'Âíèìàíèå, êîãäà Âû óäàëèòå ãðóïïó, ïîëüçîâàòåëè, êîòîðûå ïðèíàäëåæàò ýòîé ãðóïïå, áóäóò ïåðåíåñåíû â ãðóïïó \'Çàðåãèñòðèðîâàííûå\'!\n\nÂû õîòèòå ïðîäîëæèòü?',
	'title' => 'Óïðàâëåíèå ãðóïïàìè ïîëüçîâàòåëåé',
	'approval_1' => 'Îäîáð. îáùèõ äîáàâëåíèé (1)',
	'approval_2' => 'Îäîáð. ÷àñòíûõ äîáàâëåíèé (2)',
	'note1' => '<b>(1)</b> Äîáàâëåíèÿ â îáùèé àëüáîì òðåáóþò approval àäìèíèñòðàòîðà',
	'note2' => '<b>(2)</b> Äîáàâëåíèÿ â àëüáîì, ïðèíàäëåæàùèé ïîëüçîâàòåëþ, òðåáóþò ïðîâåðêè àäìèíèñòðàòîðà',
	'notes' => 'Çàìåòêè'
);

// ------------------------------------------------------------------------- //
// File index.php
// ------------------------------------------------------------------------- //

if (defined('INDEX_PHP')){

$lang_index_php = array(
	'welcome' => 'Ïðèâåò!'
);

$lang_album_admin_menu = array(
	'confirm_delete' => 'Âû äåéñòâèòåëüíî õîòèòå ÓÄÀËÈÒÜ ýòîò àëüáîì ? \\nÂñå ôîòî è êîììåíòàðèè òîæå óäàëÿòñÿ.',
	'delete' => 'ÓÄÀËÈÒÜ',
	'modify' => 'ÑÂÎÉÑÒÂÀ',
	'edit_pics' => 'ÏÐÀÂÈÒÜ',
);

$lang_list_categories = array(
	'home' => 'Íà÷àëî',
	'stat1' => '<b>[pictures]</b> ôîòî â <b>[albums]</b> àëüáîìàõ è <b>[cat]</b> êàòåãîðèÿõ ñ <b>[comments]</b> êîììåíòàðèÿìè, ïðîñìîòðåíî <b>[views]</b> ðàç',
	'stat2' => '<b>[pictures]</b> ôîòî â <b>[albums]</b> àëüáîìàõ ïðîñìîòðåíî <b>[views]</b> ðàç',
	'xx_s_gallery' => 'Ãàëåðåÿ %s\'à',
	'stat3' => '<b>[pictures]</b> ôîòî â <b>[albums]</b> àëüáîìàõ <b>[comments]</b> êîììåíòàðèÿìè, ïðîñìîòðåíî <b>[views]</b> ðàç'
);

$lang_list_users = array(
	'user_list' => 'Ñïèñîê ïîëüçîâàòåëåé',
	'no_user_gal' => 'Çäåñü íåò ãàëåðåé ïîëüçîâàòåëåé',
	'n_albums' => '%s àëüáîìîâ',
	'n_pics' => '%s ôîòî'
);

$lang_list_albums = array(
	'n_pictures' => '%s ôîòî',
	'last_added' => ', ïîñëåäíåå äîáàâëåíî %s'
);

}

// ------------------------------------------------------------------------- //
// File login.php
// ------------------------------------------------------------------------- //

if (defined('LOGIN_PHP')) $lang_login_php = array(
	'login' => 'Âõîä',
	'enter_login_pswd' => 'Ââåäèòå èìÿ è ïàðîëü äëÿ âõîäà',
	'username' => 'Èìÿ',
	'password' => 'Ïàðîëü',
	'remember_me' => 'Çàïîìíèòü ìåíÿ',
	'welcome' => 'Ïðèâåò, %s ...',
	'err_login' => '*** Íåâîçìîæíî âîéòè. Ïîïðîáóéòå ñíîâà ***',
	'err_already_logged_in' => 'Âû óæå âîøëè!',
);

// ------------------------------------------------------------------------- //
// File logout.php
// ------------------------------------------------------------------------- //

if (defined('LOGOUT_PHP')) $lang_logout_php = array(
	'logout' => 'Âûõîä',
	'bye' => 'Ïîêà, %s ...',
	'err_not_loged_in' => 'Âû íå âîøëè!',
);

// ------------------------------------------------------------------------- //
// File modifyalb.php
// ------------------------------------------------------------------------- //

if (defined('MODIFYALB_PHP')) $lang_modifyalb_php = array(
	'upd_alb_n' => 'Îáíîâëåíèå àëüáîìà %s',
	'general_settings' => 'Îáùèå íàñòðîéêè',
	'alb_title' => 'Çàãîëîâîê',
	'alb_cat' => 'Êàòåãîðèÿ',
	'alb_desc' => 'Îïèñàíèå',
	'alb_thumb' => 'Ýñêèç',
	'alb_perm' => 'Ðàçðåøåíèÿ äëÿ ýòîãî àëüáîìà',
	'can_view' => 'Àëüáîì ìîæåò áûòü ïðîñìîòðåí',
	'can_upload' => 'Ãîñòè ìîãóò äîáàâëÿòü ôîòî',
	'can_post_comments' => 'Ãîñòè ìîãóò îñòàâëÿòü êîììåíòàðèè',
	'can_rate' => 'Ãîñòè ìîãóò îöåíèâàòü ôîòî',
	'user_gal' => 'Ïîëüçîâàòåëüñêàÿ ãàëåðåÿ',
	'no_cat' => '* Íåò êàòåãîðèè *',
	'alb_empty' => 'Àëüáîì ïóñòîé',
	'last_uploaded' => 'Ïîñëåäíèå îáíîâëåíèÿ',
	'public_alb' => 'Âñå (îáùèé àëüáîì)',
	'me_only' => 'Òîëüêî ÿ',
	'owner_only' => 'Òîëüêî õîçÿèí àëüáîìà (%s)',
	'groupp_only' => '×ëåíû ãðóïïû \'%s\'',
	'err_no_alb_to_modify' => 'Â áàçå íåòó àëüáîìîâ, êîòîðûå Âû ìîæåòå ðàäàêòèðîâàòü.',
	'update' => 'Îáíîâèòü àëüáîì'
);

// ------------------------------------------------------------------------- //
// File ratepic.php
// ------------------------------------------------------------------------- //

if (defined('RATEPIC_PHP')) $lang_rate_pic_php = array(
	'already_rated' => 'Âû óæå îöåíèëè ýòî ôîòî',
	'rate_ok' => 'Âàø ãîëîñ ïðèíÿò',
);

// ------------------------------------------------------------------------- //
// File register.php & profile.php
// ------------------------------------------------------------------------- //

if (defined('REGISTER_PHP') || defined('PROFILE_PHP')) {

$lang_register_disclamer = <<<EOT
Ïîêà àäìèíèñòðàòîðû ñàéòà '<b>{SITE_NAME}</b>' áóäóò ïûòàòüñÿ óäàëèòü èëè ðåäàêòèðîâàòü ëþáîé íåæåëàòåëüíûé ìàòåðèàë íàñòîëüêî áûñòðî, íàñêîëüêî âîçìîæíî (ïîòîìó ÷òî íåâîçìîæíî ðàññìîòðåòü êàæäîå ñîîáùåíèå), Âû ïîäòâåðæäàåòå, ÷òî âñå ñîîáùåíèÿ, ñäåëàííûå íà ýòîì ñàéòó âûðàæàþò âçãëÿäû è ìíåíèÿ àâòîðà, à íå àäìèíèñòðàòîðîâ èëè âåáìàñòåðà (èñêëþ÷åíèå ñîñòàâëÿþò ñîîáùåíèÿ, îòïðàâëåííûå íåïîñðåäñòâåííî ýòèìè ëþäüìè) è ñëåäîâàòåëüíî íå áóäóò ïîääåðæàíû îòâåòñòâåííûìè ëèöàìè. <br />
<br />
Âû îáåùàåòå íå ïîñûëàòü îñêîðáèòåëüíûé, íåïðèñòîéíûé, âóëüãàðíûé, êëåâåòíè÷åñêèé, íåíàâèñòíûé, óãðîæàþùèé, ñåêñóàëüíî-îðèåíòèðóåìûé èëè ëþáîé äðóãîé ìàòåðèàë, êîòîðûé ìîæåò íàðóøèòü ëþáûå ïðèìåíèìûå çàêîíû. Âû ñîãëàøàåòåñü ñ òåì, ÷òî âåáìàñòåð, àäìèíèñòðàòîð è ìîäåðàòîðû ñàéòà '<b>{SITE_NAME}</b>' èìåþò ïðàâî óäàëÿòü èëè ðåäàêòèðîâàòü ëþáîå ñîäåðæèìîå. Êàê ïîëüçîâàòåëü Âû ñîãëàøàåòåñü ñ òåì, ÷òî ëþáàÿ èíôîðìàöèÿ, ââåäåííàÿ Âàìè áóäåò çàïèñàíà â áàçó äàííûõ. Ýòà èíôîðìàöèÿ íå áóäåò ðàñêðûòà òðåòüèì ëèöàì áåç Âàøåãî ñîãëàñèÿ. Âåáìàñòåð è àäìèíèñòðàòîð íå íåñåò îòâåòñòâåííîñòè çà ëþáûå ïîïûòêè âçëîìà, êîòîðûå ìîãóò ïðèâåñòè ê êîìïðîìåòèðóåìûì äàííûì.<br />
<br />
Ýòîò ñàéò èñïîëüçóåò 'cookies' äëÿ õðàíåíèÿ èíôîðìàöèè íà Âàøåì êîìïüþòåðå. Ýòè 'cookies' ñëóæàò òîëüêî äëÿ óëó÷øåíèÿ Âàøåãî ïðîñìîòðà. Àäðåñ E-mail èñïîëüçóåòñÿ òîëüêî äëÿ ïîäòâåðæäåíèÿ Âàøèõ ðåãèñòðàöèîííûõ äàííûõ è ïàðîëÿ.<br />
<br />
Íàæàâ íèæå íà 'Ñîãëàñåí' Âû ïîäòâåðæäàåòå ñîãëàñèå ñî âñåìè âûøåíàïèñàííûìè óñëîâèÿìè.
EOT;

$lang_register_php = array(
	'page_title' => 'Ðåãèñòðàöèÿ ïîëüçîâàòåëÿ',
	'term_cond' => 'Óñëîâèÿ è òåðìèíû',
	'i_agree' => 'Ñîãëàñåí',
	'submit' => 'Ïðîäîëæèòü ðåãèñòðàöèþ',
	'err_user_exists' => 'Èìÿ ïîëüçîâàòåëÿ, êîòîðûå Âû ââåëè, óæå ñóùåñòâóåò â áàçå, ïîæàëóéñòà, âûáåðèòå äðóãîå èìÿ',
	'err_password_mismatch' => 'Ïàðîëè íå ñîâïàäàþò, ïîæàëóéñòà, ââåäèòå èõ ñíîâà',
	'err_uname_short' => 'Â èìåíè ïîëüçîâàòåëÿ äîëæíî áûòü ìèíèìóì 2 ñèìâîëà',
	'err_password_short' => 'Ïàðîëü äîëæåí áûòü ìèíèìóì 2 ñèìâîëà',
	'err_uname_pass_diff' => 'Èìÿ ïîëüçîâàòåëÿ è ïàðîëü äîëæíû áûòü ðàçíûìè',
	'err_invalid_email' => 'Àäðåñ Email óêàçàí íåâåðíî',
	'err_duplicate_email' => 'Êòî-òî óæå çàðåãèñòðèðîâàëñÿ ñ e-mail àäðåñîì, êîòîðûé Âû óêàçàëè',
	'enter_info' => 'Ââåäèòå ðåãèñòðàöèîííóþ èíôîðìàöèþ',
	'required_info' => 'Íåîáõîäèìàÿ èíôîðìàöèÿ',
	'optional_info' => 'Äîïîëíèòåëüíàÿ èíôîðìàöèÿ',
	'username' => 'Èìÿ',
	'password' => 'Ïàðîëü',
	'password_again' => 'Ïîâòîð ïàðîëÿ',
	'email' => 'Email',
	'location' => 'Îòêóäà',
	'interests' => 'Óâëå÷åíèÿ',
	'website' => 'Ñàéò',
	'occupation' => 'Ðîä çàíÿòèé',
	'error' => 'ÎØÈÁÊÀ',
	'confirm_email_subject' => '%s - Ïîäòâåðæäåíèå ðåãèñòðàöèè',
	'information' => 'Èíôîðìàöèÿ',
	'failed_sending_email' => 'E-mail î ïîäòâåðæäåíèè ðåãèñòðàöèè íå ìîæåò áûòü îòïðàâëåí!',
	'thank_you' => 'Ñïàñèáî çà ðåãèñòðàöèþ.<br /><br />An email with information on how to activate your account was sent to the email address your provided.',
	'acct_created' => 'Âàøà ó÷åòíàÿ çàïèñü ñîçäàíà. Âû ìîæåòå âîéòè, èñïîëüçóÿ Âàøå èìÿ è ïàðîëü',
	'acct_active' => 'Âàøà ó÷åòíàÿ çàïèñü àêòèâíà è Âû ìîæåòå âîéòè, èñïîëüçóÿ Âàøå èìÿ è ïàðîëü',
	'acct_already_act' => 'Âàøà ó÷åòíàÿ çàïèñü óæå àêòèâíà!',
	'acct_act_failed' => 'Ýòà ó÷åòíàÿ çàïèñü íå ìîæåò áûòü àêòèâèðîâàíà!',
	'err_unk_user' => 'Âûáðàííûé ïîëüçîâàòåëü íå ñóùåñòâóåò!',
	'x_s_profile' => 'Ïðîôèëü %s',
	'group' => 'Ãðóïïà',
	'reg_date' => 'Äàòà ðåãèñòðàöèè',
	'disk_usage' => 'Èñïîëüç. äèñêà',
	'change_pass' => 'Ñìåíèòü ïàðîëü',
	'current_pass' => 'Òåêóùèé ïàðîëü',
	'new_pass' => 'Íîâûé ïàðîëü',
	'new_pass_again' => 'Íîâûé ïàðîëü (ïîâòîð)',
	'err_curr_pass' => 'Òåêóùèé ïàðîëü íåâåðíûé',
	'apply_modif' => 'Ïðèìåíèòü èçìåíåíèÿ',
	'change_pass' => 'Ñìåíèòü ìîé ïàðîëü',
	'update_success' => 'Âàø ïðîôèëü îáíîâëåí',
	'pass_chg_success' => 'Âàø ïàðîëü èçìåí¸í',
	'pass_chg_error' => 'Âàø ïàðîëü íå èçìåí¸í',
);

$lang_register_confirm_email = <<<EOT
Áëàãîäàðèì Âàñ çà ðåãèñòðàöèþ íà {SITE_NAME}

Âàøå èìÿ  : "{USER_NAME}"
Âàø ïàðîëü: "{PASSWORD}"

Äëÿ àêòèâàöèè Âàøåé ó÷åòíîé çàïèñè, Âû äîëæíû íàæàòü íà ññûëêó íèæå èëè
ñêîïèðîâàòü è âñòàâèòü åå â âåá-áðàóçåð.

{ACT_LINK}

Ñ óâàæåíèåì,

Àäìèíèñòðàöèÿ {SITE_NAME}

EOT;

}

// ------------------------------------------------------------------------- //
// File reviewcom.php
// ------------------------------------------------------------------------- //

if (defined('REVIEWCOM_PHP')) $lang_reviewcom_php = array(
	'title' => 'Ïðîâåðêà êîììåíòàðèåâ',
	'no_comment' => 'Çäåñü íåò êîììåíòàðèåâ äëÿ ïðîâåðêè',
	'n_comm_del' => '%s êîììåíòàðèåâ óäàëåíî',
	'n_comm_disp' => 'Êîëè÷åñòâî êîììåíòàðèåâ äëÿ ïîêàçà',
	'see_prev' => 'Ñìîòðåòü ïðåäûäóùèé',
	'see_next' => 'Ñìîòðåòü ñëåäóþùèé',
	'del_comm' => 'Óäàëèòü âûáðàííûå êîììåíòàðèè',
);


// ------------------------------------------------------------------------- //
// File search.php - OK
// ------------------------------------------------------------------------- //

if (defined('SEARCH_PHP')) $lang_search_php = array(
	0 => 'Ïîèñê êîëëåêöèè ôîòî',
);

// ------------------------------------------------------------------------- //
// File searchnew.php
// ------------------------------------------------------------------------- //

if (defined('SEARCHNEW_PHP')) $lang_search_new_php = array(
	'page_title' => 'Èñêàòü íîâûå ôîòî',
	'select_dir' => 'Âûáðàòü ïàïêó',
	'select_dir_msg' => 'Ýòà ôóíêöèÿ ïîçâîëÿåò äîáàâëÿòü ôîòî â \'ïàêåòíîì ðåæèìå\'.<br /><br />Âûáåðèòå ïàïêó, êóäà Âû õîòèòå äîáàâèòü Âàøè ôîòî',
	'no_pic_to_add' => 'Çäåñü íåò ôîòî äëÿ äîáàâëåíèÿ',
	'need_one_album' => 'Âàì íåîáõîäèìî êàê ìèíèìóì îäèí àëüáîì äëÿ èñïîëüçîâàíèÿ ýòîé ôóíêöèè',
	'warning' => 'Âíèìàíèå',
	'change_perm' => 'ñêðèïò íå ìîæåò çàïèñàòü â ýòó ïàïêó, Âàì íàäî ñìåíèòü ðåæèì íà 755 èëè 777 ïåðåä ïîïûòêîé äîáàâèòü ôîòî!',
	'target_album' => '<b>Ïîëîæèòü ôîòî èç &quot;</b>%s<b>&quot; â </b>%s',
	'folder' => 'Ïàïêà',
	'image' => 'Ôîòî',
	'album' => 'Àëüáîì',
	'result' => 'Ðåçóëüòàò',
	'dir_ro' => 'òîëüêî äëÿ ÷òåíèÿ. ',
	'dir_cant_read' => 'Íå÷èòàåìûé. ',
	'insert' => 'Äîáàâëåíèå íîâûõ ôîòî â ãàëåðåþ',
	'list_new_pic' => 'Ñïèñîê íîâûõ ôîòî',
	'insert_selected' => 'Âñòàâèòü âûáðàííûå ôîòî',
	'no_pic_found' => 'Íîâûõ ôîòî íå íàéäåíî',
	'be_patient' => 'Óñïîêîéòåñü, òðåáóåòñÿ êàêîå-òî âðåìÿ äëÿ äîáàâëåíèÿ ôîòî',
	'notes' =>  '<ul>'.
				'<li><b>OK</b> : çíà÷èò, ÷òî ôîòî äîáàâëåíî óñïåøíî'.
				'<li><b>DP</b> : çíà÷èò, ÷òî ôîòî äóáëèðóåòñÿ è óæå èìååòñÿ â áàçå'.
				'<li><b>PB</b> : çíà÷èò, ÷òî ôîòî íå äîáàâëåíî. Ïðîâåðüòå Âàøè íàñòðîéêè è ðàçðåøåíèÿ â ïàïêàõ, ãäå íàõîäèòñÿ ôîòî'.
				'<li>Åñëè \'çíàêè\' OK, DP, PB íå ïîÿâëÿþòñÿ, íàæìèòå íà ïëîõîì ôîòî äëÿ ïðîñìîòðà ñîîáùåíèÿ îá îøèáêå, ñäåëàííîé PHP'.
				'<li>Åñëè áðîóçåð timeout, íàæìèòå êíîïêó \'Îáíîâèòü\''.
				'</ul>',
);


// ------------------------------------------------------------------------- //
// File thumbnails.php
// ------------------------------------------------------------------------- //

// Void


// ------------------------------------------------------------------------- // 
// File banning.php 
// ------------------------------------------------------------------------- // 

if (defined('BANNING_PHP')) $lang_banning_php = array( 
                'title' => 'Áàí ïîëüçîâàòåëåé', 
                'user_name' => 'Âàøå èìÿ', 
                'ip_address' => 'IP àäðåññ', 
                'expiry' => 'Èñòåêàåò (åñëè ïóñòî - íåâñåãäà)', 
                'edit_ban' => 'Ñîõðàíèòü èçìåíåíèÿ', 
                'delete_ban' => 'Óäàëèòü', 
                'add_new' => 'Äîáàâèòü íîâûé áàí', 
                'add_ban' => 'Äîáàâèòü', 
); 

// ------------------------------------------------------------------------- //
// File upload.php
// ------------------------------------------------------------------------- //

if (defined('UPLOAD_PHP')) $lang_upload_php = array(
	'title' => 'Äîáàâèòü ôîòî',
	'max_fsize' => 'Ìàêñèìàëüíûé ðàçðåøåííûé ðàçìåð ôàéëà: %s êá',
	'album' => 'Àëüáîì',
	'picture' => 'Ôîòî',
	'pic_title' => 'Çàãîëîâîê ôîòî',
	'description' => 'Îïèñàíèå ôîòî',
	'keywords' => 'Êëþ÷åâûå ñëîâà<br>(ðàçäåëåííûå ïðîáåëîì)',
	'err_no_alb_uploadables' => 'Èçâèíèòå, çäåñü íåò àëüáîìà, êóäà Âû ìîãëè áû äîáàâèòü ôîòî',
);

// ------------------------------------------------------------------------- //
// File usermgr.php
// ------------------------------------------------------------------------- //

if (defined('USERMGR_PHP')) $lang_usermgr_php = array(
	'title' => 'Óïðàâëåíèå ïîëüçîâàòåëÿìè',
	'name_a' => 'Èìåíè [âîçðàñòàíèå]',
	'name_d' => 'Èìåíè [óáûâàíèå]',
	'group_a' => 'Ãðóïïå [âîçðàñòàíèå]',
	'group_d' => 'Ãðóïïå [óáûâàíèå]',
	'reg_a' => 'Äàòå ðåãèñòðàöèè [âîçðàñòàíèå]',
	'reg_d' => 'Äàòå ðåãèñòðàöèè [óáûâàíèå]',
	'pic_a' => 'Êîë-âó êàðòèíîê [âîçðàñòàíèå]',
	'pic_d' => 'Êîë-âó êàðòèíîê [óáûâàíèå]',
	'disku_a' => 'Disk usage [âîçðàñòàíèå]',
	'disku_d' => 'Disk usage [óáûâàíèå]',
	'sort_by' => 'Ñîðòèðîâàòü ïîëüçîâàòåëåé ïî',
	'err_no_users' => 'Òàáëèöà ïîëüçîâàòåëåé ïóñòàÿ!',
	'err_edit_self' => 'Âû íå ìîæåòå ïðàâèòü ñâîé ïðîôèëü, èñïîëüçóéòå ññûëêó \'Ïðîôèëü\' äëÿ ýòîãî',
	'edit' => 'ÏÐÀÂÈÒÜ',
	'delete' => 'ÓÄÀËÈÒÜ',
	'name' => 'Èìÿ ïîëüçîâàòåëÿ',
	'group' => 'Ãðóïïà',
	'inactive' => 'Íåàêòèâíûé',
	'operations' => 'Äåéñòâèÿ',
	'pictures' => 'êàðòèíêè',
	'disk_space' => 'Îáúåì çàíÿò/êâîòà',
	'registered_on' => 'Çàðåãèñòðèðîâàí',
	'u_user_on_p_pages' => '%d ïîëüçîâàòåëÿ(åé) íà %d ñòðàíèöå(àõ)',
	'confirm_del' => 'Âû äåéñòâèòåëüíî õîòèòå ÓÄÀËÈÒÜ ýòîãî ïîëüçîâàòåëÿ? \\nÂñå åãî êàðòèíêè è àëüáîìû òàêæå áóäóò óäàëåíû.',
	'mail' => 'ÏÎ×ÒÀ',
	'err_unknown_user' => 'Âûáðàííûé ïîëüçîâàòåëü íå ñóùåñòâóåò !',
	'modify_user' => 'Èçìåíåíèå ïîëüçîâàòåëÿ',
	'notes' => 'Ïðèìå÷àíèÿ',
	'note_list' => '<li>Åñëè Âû íå õîòèòå ìåíÿòü òåêóùèé ïàðîëü ïîëüçîâàòåëÿ, îñòàâüòå ïîëå "ïàðîëü" ïóñòûì',
	'password' => 'Ïàðîëü',
	'user_active' => 'Ïîëüçîâàòåëü àêòèâåí',
	'user_group' => 'Ãðóïïà',
	'user_email' => 'Email',
	'user_web_site' => 'Âåáñàéò',
	'create_new_user' => 'Ñîçäàòü íîâîãî ïîëüçîâàòåëÿ',
	'user_location' => 'Îòêóäà',
	'user_interests' => 'Èíòåðåñû',
	'user_occupation' => 'Çàíÿòèÿ',
);


// ------------------------------------------------------------------------- // 
// File util.php 
// ------------------------------------------------------------------------- // 

if (defined('UTIL_PHP')) $lang_util_php = array( 
        'title' => 'Èçìåíèòü ðàçìåð', 
        'what_it_does' => '×òî ýòî äåëàåò', 
        'what_update_titles' => 'Îáíîâèòü íàçâàíèå èç èìåíè ôàèëà', 
        'what_delete_title' => 'Óäàëèòü íàçâàíèÿ', 
        'what_rebuild' => 'Ïåðåñòðîèòü ýêñèçû è èçìåíèòü ðàçìåð ôîòî', 
        'what_delete_originals' => 'Çàìåíà îðèãèíàëüíûõ ôîòî, ôîòêàìè ñ èçìåíåííûì ðàçìåðîì', 
        'file' => 'Ôàèë', 
        'title_set_to' => 'óñòàíîâëåíî íàçâàíèå â', 
        'submit_form' => 'îòïðàâèòü', 
        'updated_succesfully' => 'îáíîâëåíèå ïðîøëî óñïåøíî', 
        'error_create' => 'ÎØÈÁÊÀ ñîçäàíèÿ', 
        'continue' => 'Â ïðîöåññå ìíîãî êàðòèíîê', 
        'main_success' => 'Ôàèë %s óñïåøíî èñïîëüçîâàëñÿ êàê ãëàâíàÿ êàðòèíêà', 
        'error_rename' => 'Îøèáêà ïåðåìåíîâàíèÿ %s â %s', 
        'error_not_found' => 'Ôàèë %s íå íàéäåí', 
        'back' => 'íàçàä íà ãëàâíóþ', 
        'thumbs_wait' => 'Îáíîâëåíèå ýêñèçîâ è/èëè èçìåíåíèÿ ðàçìåðîâ êàðòèíêè, ïîæàëóéñòà ïîäîæäèòå...', 
        'thumbs_continue_wait' => 'Ïðîáîëæåíèå îáíîâëåíèÿ ýêñèçà è/èëè èçìåíåíèÿ ðàçìåðîâ êàðòèíêè...', 
        'titles_wait' => 'Îáíîâëåíèå çàãîëîâêîâ, ïîæàëóéñòà ïîäîæäèòå...', 
        'delete_wait' => 'Êäàëåíèå çàãîëîâêîâ, ïîæàëóéñòà ïîäîæäèòå...', 
        'replace_wait' => 'Óäàëåíèå îðèãèíàëüíûõ è çàìåíà èçìåíåííûìè êàðòèíêàìè, ïîæàëóéñòà ïîäîæäèòå..', 
        'instruction' => 'Áûñòðûå èíñòðóêöèè', 
        'instruction_action' => 'Âûáåðèòå äåéñòâèå', 
        'instruction_parameter' => 'Óñòàíîâèòü ïàðàìåòðû', 
        'instruction_album' => 'Âûáðàòü àëüáîì', 
        'instruction_press' => 'Íàæìèòå %s', 
        'update' => 'Îáíîâëåíèå ýêñèçîâ è/èëè ðàçìåðîâ ôîòî', 
        'update_what' => '×òî äîëæíî áûòü îáíîâëåíî', 
        'update_thumb' => 'Òîëüêî ýêñèçû', 
        'update_pic' => 'Òîëüêî èçìåíåíèå ðàçìåðîâ', 
        'update_both' => 'Ýêñèçû è èçìåíåíèÿ ðàçìåðîâ', 
        'update_number' => '×èñëî îáðàáîòàííûõ èçîáðàæåíèé', 
        'update_option' => '(Ïîïðîáóéòå íàñòðîèòü îïöèþ íèæå, åñëè ó âàñ ïðîáëåìû ñ timeout)', 
        'filename_title' => 'Èìÿ ôàèëà ? Íàçâàíèå êàðòèíêè', 
        'filename_how' => 'Êàê äîëæíî áûòü èçìåíåíî èìÿ ôàèëà', 
        'filename_remove' => 'Óäàëèòü â êîíöå .jpg è çàìåíèòü _ (ïîä÷åðêèâàíèå) ñ ïðîáåëàìè', 
        'filename_euro' => 'Èçìåíèòü 2003_11_23_13_20_20.jpg íà 23/11/2003 13:20', 
        'filename_us' => 'Èçìåíèòü 2003_11_23_13_20_20.jpg íà 11/23/2003 13:20', 
        'filename_time' => 'Èçìåíèòü 2003_11_23_13_20_20.jpg íà 13:20', 
        'delete' => 'Óäàëèòü íàçâàíèå êàðòèíêè è îðèãèíàëüíûé ðàçìåð ôîòî', 
        'delete_title' => 'Óäàëèòü íàçâàíèå êàðòèíêè', 
        'delete_original' => 'Óäàëèòü îðèãèíàëüíûé ðàçìåð êàðòèíêè', 
        'delete_replace' => 'Çàìåíà îðèãèíàëüíûõ ôîòî, ôîòêàìè ñ èçìåíåííûì ðàçìåðîì', 
        'select_album' => 'Âûáðàòü àëüáîì', 
);

?>